000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗакрытиеЛистаЖеланий/ЗакрытиеЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеЛистаЖеланий</name>
  <registerRecords>AccumulationRegister.ЛистыЖеланий</registerRecords>
  <registerRecords>InformationRegister.СостояниеЛистаЖеланий</registerRecords>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>CatalogRef.АнкетаЛистаЖеланий</types>
    </type>
  </attributes>
  <attributes>
    <name>Корзина</name>
    <type>
      <types>CatalogRef.КорзиныЛистаЖеланий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистЖеланий</name>
    <type>
      <types>DocumentRef.ЛистЖеланий</types>
    </type>
  </attributes>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ЛистыЖеланий/ЛистыЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛистыЖеланий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацияЛистаЖеланий</types>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛистЖеланий</name>
    <type>
      <types>DocumentRef.ЛистЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корзина</name>
    <type>
      <types>CatalogRef.КорзиныЛистаЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СостояниеЛистаЖеланий/СостояниеЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеЛистаЖеланий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОписаниеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛистЖеланий</name>
    <type>
      <types>DocumentRef.ЛистЖеланий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеЛистаЖеланий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОперацияЛистаЖеланий/ОперацияЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацияЛистаЖеланий</name>
  <enumValues>
    <name>Добавление</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПоИстеченииСрока</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СостояниеЛистаЖеланий/СостояниеЛистаЖеланий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЛистаЖеланий</name>
  <enumValues>
    <name>Создание</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗакрытиеЛистаЖеланий/ObjectModule.bsl
//	LNK 14.08.2017 11:05:45
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И НЕ ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() Тогда

		Отказ = Истина;
		Сообщить("Отказано! Отмена проведения документа запрещена.");

	КонецЕсли;

КонецПроцедуры

//	LNK 14.08.2017 11:05:51
Процедура ПриЗаписи(Отказ)


КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистыЖеланийОстатки.Магазин,
		|	ЛистыЖеланийОстатки.ЛистЖеланий,
		|	ЛистыЖеланийОстатки.Корзина,
		|	ЛистыЖеланийОстатки.Номенклатура,
		|	ЛистыЖеланийОстатки.Характеристика,
		|	ЛистыЖеланийОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЛистыЖеланий.Остатки(, ЛистЖеланий = &ЛистЖеланий) КАК ЛистыЖеланийОстатки";
	
	Запрос.УстановитьПараметр("ЛистЖеланий", ЛистЖеланий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОписаниеОстатковНоменклатуры = "";
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Движения.ЛистыЖеланий.Записывать = Истина;
		ОписаниеОстатковНоменклатуры = "По истечению срока действия листа желаний была снята с резерва следующая номенклатура;" + Символы.ПС;
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ЛистыЖеланий.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Магазин = Магазин;
			Движение.ЛистЖеланий = ЛистЖеланий;
			Движение.Корзина = Корзина;
			Движение.Операция = Перечисления.ОперацияЛистаЖеланий.ОтменаПоИстеченииСрока;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Характеристика = Выборка.Характеристика;
			Движение.Количество = Выборка.КоличествоОстаток;
			ОписаниеОстатковНоменклатуры = ОписаниеОстатковНоменклатуры + Выборка.Номенклатура +" в количестве "+ Выборка.КоличествоОстаток + Символы.ПС;
		КонецЦикла;
	КонецЕсли; 
	
	
	// регистр СостояниеЛистаЖеланий
	Движения.СостояниеЛистаЖеланий.Записывать = Истина;
	Движение = Движения.СостояниеЛистаЖеланий.Добавить();
	Движение.Период = Дата;
	Движение.Магазин = Магазин;
	Движение.ЛистЖеланий = ЛистЖеланий;
	Движение.Состояние = Перечисления.СостояниеЛистаЖеланий.Закрытие;
	
	ОписаниеОперации = "Закрытие листа желаний №"+ Номер + " от " + Дата + ", на корзину №" + Корзина + ".";
	Если  ЗначениеЗаполнено(ОписаниеОстатковНоменклатуры) Тогда
		 ОписаниеОперации = ОписаниеОперации + Символы.ПС + ОписаниеОстатковНоменклатуры
	КонецЕсли; 
	Движение.ОписаниеОперации = ОписаниеОперации ;
КонецПроцедуры
